imported/solids4foam/tutorials/fluidSolidInteraction/3dTube/RobinFsi3dTube/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.02;

deltaT          2.5e-5;

writeControl    runTime;

writeInterval   1e-3;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.2;

functions
(
    pointHistory
    {
        type            pointHistory;
        region          solid;
        refHistoryPoint (0 0.005 0.025);
    }

	solidForce
	{
		type           solidForces;
		historyPatch   inner-wall;
	}

	forces
	{
	   type                forces;
	   functionObjectLibs  ( "libforces.so" );
	   outputControl       timeStep;
	   outputInterval      1;
	   patches             (wall);
	   pName               p;
	   UName               U;
	   rhoName             rhoInf;
	   log                 false;
	   rhoInf              1000;
	   CofR                (0.5 0.1 0);
	   region              fluid;
	}
);

// ************************************************************************* //
