imported/solids4foam/tutorials/fluidSolidInteraction/3dTube/RobinFsi3dTube/constant/fluid/time-series
(
    (0      1.3333)
    (3e-3   1.3333)
    (3.1e-3 0)
    (1e-2   0)
)
