imported/solids4foam/tutorials/fluidSolidInteraction/3dTube/RobinFsi3dTube/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default     leastSquares;
}

divSchemes
{
    default     none;
    div(phi,U)  Gauss linearUpwind cellLimited leastSquares 1;
}

laplacianSchemes
{
    default                 none;
    laplacian(nu,U)         Gauss linear corrected;
    laplacian(rAU,p)        Gauss linear corrected;
    laplacian((1|A(U)),p)   Gauss linear corrected;
    laplacian(diffusivity,cellMotionU) Gauss linear corrected;
}

interpolationSchemes
{
    default     linear;
}

snGradSchemes
{
    default     corrected;
}

fluxRequired
{
    default    no;
    p;
}


// ************************************************************************* //
